renesas/ra-fsp-examples/example_projects/ek_ra8e2/drw/drw_ek_ra8e2_ep/e2studio/src/DRW_ep.c
 /* Change to Page 7 CMD for Normal command */
 {6, {0xFF, 0xFF, 0x98, 0x06, 0x04, 0x07}, MIPI_DSI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
 {2, {0x18, 0x1d}, MIPI_DSI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER}, /* VREG1/2OUT ENABLE */
 {2, {0x26, 0xb2}, MIPI_DSI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
 {2, {0x02, 0x77}, MIPI_DSI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
 {2, {0xe1, 0x79}, MIPI_DSI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER},
 {2, {0x17, 0x22}, MIPI_DSI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER}, /* VGL_REG Disable */

 /* Change to Page 0 CMD for Normal command */
 {6, {0xFF, 0xFF, 0x98, 0x06, 0x04, 0x00}, MIPI_DSI_CMD_ID_DCS_LONG_WRITE, MIPI_DSI_CMD_FLAG_LOW_POWER},
 /* Sleep out command may not be issued within 120 ms of GPIO HW reset. Wait to ensure timing maintained */
 {120, {0}, MIPI_DSI_DISPLAY_CONFIG_DATA_DELAY_FLAG, (mipi_dsi_cmd_flag_t)0}, 
 {2, {0x11, 0x00}, MIPI_DSI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER}, /* Sleep-Out */
 {5, {0}, MIPI_DSI_DISPLAY_CONFIG_DATA_DELAY_FLAG, (mipi_dsi_cmd_flag_t)0}, /* Delay 5msec */
 {2, {0x29, 0x00}, MIPI_DSI_CMD_ID_DCS_SHORT_WRITE_0_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER}, /* Display on */
 {2, {0x3a, 0x70}, MIPI_DSI_CMD_ID_DCS_SHORT_WRITE_1_PARAM, MIPI_DSI_CMD_FLAG_LOW_POWER}, /* 24-bit / pixel */

 {0x00, {0}, MIPI_DSI_DISPLAY_CONFIG_DATA_END_OF_TABLE, (mipi_dsi_cmd_flag_t)0}, /* End of table */
};
#endif

/* User defined functions */
void glcdc_callback(display_callback_args_t * args);
#if defined(DISPLAY_IN_FORMAT_32BITS_RGB888_0)
static void drw_set(uint32_t * framebuffer);
static void display_draw(uint32_t * framebuffer);
#else
static void drw_set(uint8_t * framebuffer);
static void display_draw(uint8_t * framebuffer);
#endif
static void drw_animation(void);
static void error_handler(d2_s32 DRW_err,d2_device * gp_davey);
static void glcdc_init(void);
static void drw_init(void);

/*******************************************************************************************************************//**
 * @brief      This function initializes and manages the GLCDC and DRW engines for display rendering.
 *
 * @param      none
 * @retval     none
 **********************************************************************************************************************/
void DRW_entry(void)
{
    fsp_err_t err = FSP_SUCCESS;
    fsp_pack_version_t version    = {RESET_VALUE};
#if defined(DISPLAY_IN_FORMAT_32BITS_RGB888_0)
    uint32_t * p_framebuffer = NULL;
#else
    uint8_t * p_framebuffer = NULL;
#endif

    /* Version get API for FLEX pack information */
    R_FSP_VersionGet(&version);

    /* Project information printed on the Console */
    APP_PRINT(BANNER_INFO, EP_VERSION, version.version_id_b.major, version.version_id_b.minor,
              version.version_id_b.patch);
    APP_PRINT(EP_INFO);

    /* Get LCDC configuration */
    g_hz_size = (g_display_cfg.input[ARRAY_INDEX].hsize);
    g_vr_size = (g_display_cfg.input[ARRAY_INDEX].vsize);

    /* Initialize buffer pointers */
    g_buffer_size = (uint32_t) (g_hz_size * g_vr_size * BYTES_PER_PIXEL);
#if defined(DISPLAY_IN_FORMAT_32BITS_RGB888_0)
    g_p_single_buffer = (uint32_t *) g_display_cfg.input[ARRAY_INDEX].p_base;
#else
    g_p_single_buffer = (uint8_t *) g_display_cfg.input[ARRAY_INDEX].p_base;
#endif
    /* Double buffer for drawing color bands with good quality */
    g_p_double_buffer = g_p_single_buffer + g_buffer_size;

    /* GLCDC init */
    glcdc_init();

    /* Wait for a Vsync event */
    while(!g_vsync_flag);
    g_vsync_flag = RESET_FLAG;

    /* DRW initialization */
    drw_init();

    APP_PRINT("\r\nEnter any key to stop rendering and disable the GLCDC driver: \r\n");

    while(true)
    {
        /* Swap the active frame buffer */
        p_framebuffer = (p_framebuffer == g_p_single_buffer) ? g_p_double_buffer : g_p_single_buffer;

        do
        {
            /* Now that the frame buffer is ready, update the GLCDC buffer pointer on the next Vsync */
    #if defined(DISPLAY_IN_FORMAT_32BITS_RGB888_0)
            err = R_GLCDC_BufferChange(&g_display_ctrl, (uint8_t*) p_framebuffer, DISPLAY_FRAME_LAYER_1);
    #else
            err = R_GLCDC_BufferChange(&g_display_ctrl, p_framebuffer, DISPLAY_FRAME_LAYER_1);
    #endif
            if (err)
            {
                g_vsync_flag = RESET_FLAG;
                /* Wait for a Vsync event */
                while(!g_vsync_flag);
            }
        }
        while (FSP_ERR_INVALID_UPDATE_TIMING == err);

        g_vsync_flag = RESET_FLAG;
        /* Wait for a Vsync event */
        while(!g_vsync_flag);

        /* Draw the new frame buffer now */
        display_draw(p_framebuffer);

        /* Check input data from RTT */
        if (APP_CHECK_DATA)
        {
            APP_PRINT("Terminating render....\r\n");
            break;
        }
    }

    /* Wait for rendering operations to finish */
    DRW_err = d2_flushframe(gp_davey);
    error_handler(DRW_err, gp_davey);

    /* De-initialize hardware and close the handle */
    DRW_err = d2_deinithw(gp_davey);
    error_handler(DRW_err, gp_davey);

    DRW_err = d2_closedevice(gp_davey);
    error_handler(DRW_err, gp_davey);

    /* Stop GLCDC */
    err = R_GLCDC_Stop(&g_display_ctrl);
    /* Handle error */
    if(FSP_SUCCESS != err)
    {
        /* GLCDC initialization failed */
        APP_ERR_PRINT("\r\n ** GLCDC driver stop FAILED ** \r\n");
        APP_ERR_TRAP(err);
    }
    else
    {
        APP_PRINT("\r\n ** GLCDC driver stopped ** \r\n");
    }

    /* Close GLCDC */
    err = R_GLCDC_Close(&g_display_ctrl);
    /* Handle error */
    if(FSP_SUCCESS != err)
    {
        /* GLCDC initialization failed */
        APP_ERR_PRINT("\r\n ** GLCDC driver close FAILED ** \r\n");
        APP_ERR_TRAP(err);
    }
    else
    {
        APP_PRINT("\r\n ** GLCDC driver closed ** \r\n");
    }
}

/*******************************************************************************************************************//**
 * @brief      User defined function to initialize glcdc module
 *
 * @param      none
 * @retval     none
 **********************************************************************************************************************/
static void glcdc_init(void)
{
    fsp_err_t err = FSP_SUCCESS;
    /* Initialize GLCDC driver */
    err = R_GLCDC_Open(&g_display_ctrl, &g_display_cfg);
    /* Handle error */
    if(FSP_SUCCESS != err)
    {
        /* GLCDC initialization failed */
        APP_ERR_PRINT("\r\n ** GLCDC driver initialization FAILED ** \r\n");
        APP_ERR_TRAP(err);
    }
    else
    {
        APP_PRINT("\r\n ** GLCDC driver initialization SUCCESS ** \r\n");
    }

