renesas/ra-fsp-examples/example_projects/ek_ra8e2/drw/drw_ek_ra8e2_ep/e2studio/src/DRW_ep.c
#if defined(BOARD_RA8D1_EK)
    /* Initialize LCD */
    mipi_dsi_push_table(g_lcd_init_focuslcd);
#endif

    /* Start GLCDC display output */
    err = R_GLCDC_Start(&g_display_ctrl);
    /* Handle error */
    if(FSP_SUCCESS != err)
    {
        /* GLCDC initialization failed */
        APP_ERR_PRINT("\r\n ** GLCDC driver start FAILED ** \r\n");
        APP_ERR_TRAP(err);
    }
    else
    {
        APP_PRINT("\r\n ** GLCDC driver start SUCCESS ** \r\n");
    }
}

/*******************************************************************************************************************//**
 * @brief      User defined function to initialize drw module
 *
 * @param      none
 * @retval     none
 **********************************************************************************************************************/
static void drw_init(void)
{
    /* Open the D2 driver and initialize the hardware */
    gp_davey = d2_opendevice(BITFIELD_VALUE);
    DRW_err = d2_inithw(gp_davey, BITFIELD_VALUE);
    if (D2_OK == DRW_err)
    {
        APP_PRINT("\r\n ** DRW driver initialization SUCCESS ** \r\n");
    }
    else
    {
        error_handler(DRW_err, gp_davey);
    }

    /* Set the transparency and the alpha mode */
    DRW_err = d2_setalpha(gp_davey, ALPHA_VALUE);
    if (D2_OK == DRW_err)
    {
        APP_PRINT("\r\n ** Transparency set successfully ** \r\n");
    }
    else
    {
        error_handler(DRW_err, gp_davey);
    }

    DRW_err = d2_setalphamode(gp_davey, d2_am_constant);
    if (D2_OK == DRW_err)
    {
        APP_PRINT("\r\n ** Alphamode set successfully ** \r\n");
    }
    else
    {
        error_handler(DRW_err, gp_davey);
    }

    /* Set alphablend mode */
    DRW_err = d2_setblendmode(gp_davey, d2_bm_alpha, d2_bm_one_minus_alpha);
    if (D2_OK == DRW_err)
    {
        APP_PRINT("\r\n ** Alphablend mode set succesfully ** \r\n");
    }
    else
    {
        error_handler(DRW_err, gp_davey);
    }
}

/*******************************************************************************************************************//**
 * @brief      Error handler for DRW.
 *
 * @param[in]  err       Error returned from DRW APIs
 * @param[in]  gp_dave   Pointer to device structure
 * @retval     none
 **********************************************************************************************************************/
static void error_handler(d2_s32 err, d2_device * gp_dave)
{
    if (D2_OK != err)
    {
        /* Print the error message */
        APP_ERR_PRINT(d2_geterrorstring( gp_dave ));
        APP_ERR_TRAP(err);
    }
}

/*******************************************************************************************************************//**
 * @brief      Callback functions for GLCDC interrupts
 *
 * @param[in]  p_args    Callback arguments
 * @retval     none
 **********************************************************************************************************************/
void glcdc_callback (display_callback_args_t * p_args)
{
    if (p_args->event == DISPLAY_EVENT_LINE_DETECTION)
    {
        g_vsync_flag = SET_FLAG;
    }
}

/*******************************************************************************************************************//**
 * @brief      User-defined function to draw the current display to a framebuffer
 *
 * @param[in]  framebuffer    Pointer to frame buffer
 * @retval     none
 **********************************************************************************************************************/
#if defined(DISPLAY_IN_FORMAT_32BITS_RGB888_0)
static void display_draw (uint32_t * framebuffer)
{
    /* DRW operations happen here */
    /* Animation of different figure */
    drw_animation();

    /* Set frame buffer propertie */
    drw_set(framebuffer);

    /* Set the render color to red */
    DRW_err = d2_setcolor(gp_davey, ARRAY_INDEX, RED_COLOR_VAL);
    error_handler(DRW_err, gp_davey);

    /* Render a circle */
    DRW_err = d2_rendercircle(gp_davey,(d2_point)(g_c_c_x1 << SHIFT_VALUE), (d2_point)(g_c_c_y1 << SHIFT_VALUE),
                              (d2_width)(g_c_r << SHIFT_VALUE), (d2_width)(g_c_w << SHIFT_VALUE));
    error_handler(DRW_err, gp_davey);

    /* Set the render color to green */
    DRW_err = d2_setcolor(gp_davey, ARRAY_INDEX, GREEN_COLOR_VAL);
    error_handler(DRW_err, gp_davey);

    /* Render a triangle */
    DRW_err = d2_rendertri(gp_davey, (d2_point)( g_t_x1 << SHIFT_VALUE),(d2_point)( g_t_y1 << SHIFT_VALUE),
                           (d2_point)( g_t_x2 << SHIFT_VALUE),(d2_point)( g_t_y2 << SHIFT_VALUE),
                           (d2_point)( g_t_x3 << SHIFT_VALUE),(d2_point)( g_t_y3 << SHIFT_VALUE),d2_edge2_shared);
    error_handler(DRW_err, gp_davey);

    /* Set the render color to blue */
    DRW_err = d2_setcolor(gp_davey, ARRAY_INDEX, BLUE_COLOR_VAL);
    error_handler(DRW_err, gp_davey);

    /* Render a box */
    DRW_err = d2_renderbox(gp_davey,(d2_point)(g_b_x1 << SHIFT_VALUE), (d2_point)(g_b_y1 << SHIFT_VALUE),
                           (d2_width)(g_b_l << SHIFT_VALUE), (d2_width)(g_b_w << SHIFT_VALUE));
    error_handler(DRW_err, gp_davey);

    /* Set the render color to yellow */
    DRW_err = d2_setcolor(gp_davey, ARRAY_INDEX, YELLOW_COLOR_VAL);
    error_handler(DRW_err, gp_davey);

    /* Render a line */
    DRW_err = d2_renderline(gp_davey, (d2_point) (g_l_x1 << SHIFT_VALUE), (d2_point) (g_l_y1 << SHIFT_VALUE),
                            (d2_point) (g_l_x2 << SHIFT_VALUE), (d2_point) (g_l_y2 << SHIFT_VALUE),
                            (d2_width) (g_l_w << SHIFT_VALUE), d2_le_exclude_both);
    error_handler(DRW_err, gp_davey);

    /* End the display list, then call d2_start frame to begin execution */
    DRW_err = d2_endframe(gp_davey);
    error_handler(DRW_err, gp_davey);
}
#else
static void display_draw (uint8_t * framebuffer)
{
    /* DRW operations happens here */
    /* Animation of different figures */
    drw_animation();

    /* Set frame buffer properties */
    drw_set(framebuffer);

    /* Set the render color to red */
    DRW_err = d2_setcolor(gp_davey, ARRAY_INDEX, RED_COLOR_VAL);
    error_handler(DRW_err, gp_davey);

    /* Render a circle */
    DRW_err = d2_rendercircle(gp_davey,(d2_point)(g_c_c_x1 << SHIFT_VALUE), (d2_point)(g_c_c_y1 << SHIFT_VALUE),
                              (d2_width)(g_c_r << SHIFT_VALUE), (d2_width)(g_c_w << SHIFT_VALUE));
    error_handler(DRW_err, gp_davey);

