renesas/ra-fsp-examples/example_projects/ek_ra8e2/drw/drw_ek_ra8e2_ep/e2studio/src/DRW_ep.c
}
#else
/* Circle animation */
{
    /* Circle animation */
    if((g_c_c_x1 < TRIANGLE_X2) && (g_c_left_flag == true))
    {
        g_c_c_x1 += STEP_X;
    }
    if(g_c_c_x1 >= TRIANGLE_X2)
    {
        g_c_right_flag = true;
        g_c_left_flag = false;
    }

    if((g_c_c_x1 > CIRCLE_VAL_X) && (g_c_right_flag == true))
    {
        g_c_c_x1 -= STEP_X;
    }
    if(g_c_c_x1 <= CIRCLE_VAL_X)
    {
        g_c_left_flag = true;
        g_c_right_flag = false;
    }

    /* Line animation */
    if((g_l_x1 > BOX_VAL_X1) && (g_l_right_flag == true))
    {
        g_l_x1 -= STEP_X;
        g_l_x2 -= STEP_X;
    }
    if(g_l_x1 <= BOX_VAL_X1)
    {
        g_l_left_flag = true;
        g_l_right_flag = false;
    }

    if((g_l_x1 < LINE_VAL_X1) && (g_l_left_flag == true))
    {
        g_l_x1 += STEP_X;
        g_l_x2 += STEP_X;
    }
    if(g_l_x1 >= LINE_VAL_X1)
    {
        g_l_right_flag = true;
        g_l_left_flag = false;
    }

    /* Triangle animation */
    if((g_t_y1 < LINE_VAL_Y1) && (g_t_top_flag == true))
    {
        g_t_y1 += STEP_Y;
        g_t_y2 += STEP_Y;
        g_t_y3 += STEP_Y;
    }
    if(g_t_y1 >= LINE_VAL_Y1)
    {
        g_t_top_flag = false;
        g_t_bottom_flag = true;
    }

    if((g_t_y1 > TRIANGLE_Y1) && (g_t_bottom_flag == true))
    {
        g_t_y1 -= STEP_Y;
        g_t_y2 -= STEP_Y;
        g_t_y3 -= STEP_Y;
    }
    if(g_t_y1 <= TRIANGLE_Y1)
    {
        g_t_top_flag = true;
        g_t_bottom_flag = false;
    }

    /* Polygon animation */
    if((g_b_y1 > BOX_PARAM) && (g_p_bottom_flag == true))
    {
        g_b_y1 -= STEP_Y;
    }
    if(g_b_y1 <= BOX_PARAM)
    {
        g_p_top_flag = true;
        g_p_bottom_flag = false;
    }

    if((g_b_y1 < BOX_VAL_Y1) && (g_p_top_flag == true))
    {
        g_b_y1 += STEP_Y;
    }
    if(g_l_x1 >= BOX_VAL_Y1)
    {
        g_p_bottom_flag = true;
        g_p_top_flag = false;
    }
}
#endif

#if defined(BOARD_RA8D1_EK)
/*******************************************************************************************************************//**
 * @brief      Initialize LCD
 *
 * @param[in]  table  LCD Controller Initialization structure.
 * @retval     None.
 **********************************************************************************************************************/
void mipi_dsi_push_table (const lcd_table_setting_t *table)
{
    fsp_err_t err = FSP_SUCCESS;
    const lcd_table_setting_t *p_entry = table;

    while (MIPI_DSI_DISPLAY_CONFIG_DATA_END_OF_TABLE != p_entry->cmd_id)
    {
        mipi_dsi_cmd_t msg =
        {
          .channel = 0,
          .cmd_id = p_entry->cmd_id,
          .flags = p_entry->flags,
          .tx_len = p_entry->size,
          .p_tx_buffer = p_entry->buffer,
        };

        if (MIPI_DSI_DISPLAY_CONFIG_DATA_DELAY_FLAG == msg.cmd_id)
        {
            R_BSP_SoftwareDelay (table->size, BSP_DELAY_UNITS_MILLISECONDS);
        }
        else
        {
            g_message_sent = false;
            /* Send a command to the peripheral device */
            err = R_MIPI_DSI_Command (&g_mipi_dsi0_ctrl, &msg);
            handle_error(err, "** MIPI DSI Command API failed ** \r\n");
            /* Wait */
            while (!g_message_sent);
        }
        p_entry++;
    }
}

/*******************************************************************************************************************//**
 *  @brief       This function handles errors, closes all opened modules, and prints errors.
 *
 *  @param[in]   err       error status
 *  @param[in]   err_str   error string
 *  @retval      None
 **********************************************************************************************************************/
void handle_error (fsp_err_t err,  const char * err_str)
{
    if(FSP_SUCCESS != err)
    {
        /* Print the error */
        APP_ERR_PRINT(err_str);

        /* Close opened GLCD module */
        if(RESET_VALUE != g_display_ctrl.state)
        {
            if(FSP_SUCCESS != R_GLCDC_Close (&g_display_ctrl))
            {
                APP_ERR_PRINT("GLCDC Close API failed\r\n");
            }
        }
        APP_ERR_TRAP(err);
    }
}

/*******************************************************************************************************************//**
 * @brief      Callback functions for MIPI DSI interrupts
 *
 * @param[in]  p_args    Callback arguments
 * @retval     none
 **********************************************************************************************************************/
void mipi_dsi_callback(mipi_dsi_callback_args_t *p_args)
{
    switch (p_args->event)
    {
        case MIPI_DSI_EVENT_SEQUENCE_0:
        {
            if (MIPI_DSI_SEQUENCE_STATUS_DESCRIPTORS_FINISHED == p_args->tx_status)
            {
                g_message_sent = SET_FLAG;
            }
            break;
        }
        default:
        {
            break;
        }
    }
}
#endif
/*******************************************************************************************************************//**
 * @} (end addtogroup DRW_ep)
 **********************************************************************************************************************/
